from django.shortcuts import render
from django.http import HttpResponse

# Create your views here.


def main_page(request):
    return render(request, 'main.html')


def main_extra(request, page):
    if page == 'writers':
        return render(request, 'writers.html')
    elif page == 'books':
        return render(request, 'top.html')
    else:
        return HttpResponse(f'Page not found')


def writers_extra(request, writer):
    images = {'shevchenko': 'http://www.univ.kiev.ua/img/kobzar.jpg',
            'ukrainka': 'https://api.culture.pl/sites/default/files/styles/embed_image_360/public/2022-03/lesya_ukrainka_portrait_public_domain.jpg?itok=1jAIv48D',
            'franko': 'https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Іван_Якович_Франко.jpg/800px-Іван_Якович_Франко.jpg'}
    name = {'shevchenko': 'Тарас Шевченко',
            'ukrainka': 'Леся Українка',
            'franko': 'Іван Франко'}
    info = {'shevchenko': """Тара́с Григо́рович Шевче́нко, відомий також як «Кобза́р» (25 лютого (9 березня) 1814, с. Моринці, Київська губернія, Російська імперія (нині Звенигородський район, Черкаська область, Україна) — 26 лютого (10 березня) 1861, Санкт-Петербург, Російська імперія) — український поет, прозаїк, мислитель, живописець, гравер, етнограф, громадський діяч.

Літературна спадщина Шевченка, центральну роль у якій відіграє поезія, зокрема збірка «Кобзар», вважається основою сучасної української літератури та багато в чому літературної української мови. Національний герой і символ України. Діяч українського національного руху, член Кирило-Мефодіївського братства. Академік Імператорської академії мистецтв (1860).""",
            'ukrainka': """Ле́ся Украї́нка (справжнє ім'я — Лари́са Петрі́вна Ко́сач, у шлюбі Ко́сач-Кві́тка; 13 (25) лютого 1871, Звягель, Волинська губернія, Російська імперія[5] — 19 липня (1 серпня) 1913, Сурамі, Тифліська губернія, Російська імперія (нині Грузія)) — українська письменниця, перекладачка, фольклористка, феміністка та культурна діячка, співзасновниця літературного гуртка «Плеяда» та групи Українська соціал-демократія. У сучасній українській традиції входить до переліку найвідоміших жінок давньої та сучасної України[6].

Писала в жанрах поезії, лірики, епосу, драми, прози, публіцистики, розвинула жанр драматичної поеми в українській літературі. Працювала в галузі фольклористики (наспівала 220 народних мелодій) і активно долучалася до процесів українського жіночого руху та національного відродження.""",
            'franko': """Іва́н Я́кович Франко́ (27 серпня 1856, с. Нагуєвичі — 28 травня 1916, Львів, Австро-Угорщина) — видатний український поет, прозаїк, драматург, літературний критик, публіцист, перекладач, науковець, громадський і політичний діяч. Доктор філософії (1893), доктор габілітований (1895), дійсний член Наукового товариства імені Шевченка (1899), почесний доктор Харківського університету (1906)[8][9]. Член Всеукраїнського Товариства «Просвіта».

Упродовж своєї понад 40-літньої творчої активності Франко надзвичайно плідно працював як оригінальний письменник (поет, прозаїк, драматург) і перекладач, літературний критик і публіцист, багатогранний науковець — літературо-, мово-, перекладо- й мистецтвознавець, етнолог і фольклорист, історик, соціолог, політолог, економіст, філософ. Його творчий доробок, писаний українською (більшість текстів), польською, німецькою, російською, болгарською, чеською мовами, за приблизними оцінками налічує кілька тисяч творів загальним обсягом понад 100 томів. Усього за життя Франка окремими книгами і брошурами було понад 220 видань, у тому числі понад 60 збірок його оригінальних і перекладних творів різних жанрів. Він був одним із перших професійних українських письменників, тобто заробляв на життя літературною працею."""}
    return render(request, 'writer.html', context={
        'writer': name[writer], 'img': images[writer], 'info': info[writer]
    })


def writer_book(request, writer, book):
    return HttpResponse(f'{writer.title()} - {book}')


def books_extra(request, place):
    top = {
        '1': '«ДОЦЯ»',
        '2': '«УСІ ЇХНІ ДЕМОНИ»',
        '3': '“ЮПАК”',
        '4': '“#БОМБАРДИР”',
        '5': '“СТОЛІТТЯ ЯКОВА”'
    }
    author = {
        '1': 'ТАМАРА ГОРІХА ЗЕРНЯ',
        '2': 'ПОЛІНА КУЛАКОВА',
        '3': 'SAIGON',
        '4': 'КИРИЛО КРУТОРОГОВ',
        '5': 'ВОЛОДИМИР ЛИС'
    }
    info = {
        '1': {'year': '2019', 'publisher': 'Білка', 'rating': 5,
              'describe': "Зібравши реальні історії людей зі Сходу та власний болючий досвід, українська волонтерка "
                          "створила неймовірний роман про любов, відчай та війну. У головної героїні немає імені, "
                          "сім’ї, дому та речей, які вона любила. Натомість є відчай та мужність, які роблять її "
                          "справжнім воїном на полі палаючих ілюзій."},
        '2': {'year': '2020', 'publisher': 'Дім Химер', 'rating': 5,
              'describe': "Український трилер! Звучить не надто спокусливо? Просто ви ще не знайомі з творчістю "
                          "цього автора. Поліна Кулакова пише міцно, жорстко і, місцями, навіть страшно. Роман "
                          "\"Усі їхні демони\" розповідає про життя однієї сім'ї в провінційному українському місті. "
                          "Чим така історія може налякати? Дітям страшно, коли батьки сваряться, хтось випиває, "
                          "хтось йде шукати правди на вулицю. Але то дітям. По-справжньому ж страшно дорослим "
                          "читачам: за цих дітей і батьків з усіма їхніми задавненими кривдами, образами і "
                          "невтамованими пристрастями, які штовхають на криву стежину..."},
        '3': {'year': '2020', 'publisher': 'Білка', 'rating': 5,
              'describe': "Яким ви уявляєте село? «ЮПАК» показує всю його красу та самобутність на початку тисячоліття:"
                          " традиції І звичаї, соціальні відносини і чіткий поділ на класи, вплив багатих «авторитетів»"
                          " на життя сільських жителів, розбірки в клубах, життя «чотких» пацанів та навіть місцеві "
                          "забобони. Яскрава картинка минулого, яке кануло у небуття."},
        '4': {'year': '2017', 'publisher': 'Фабула', 'rating': 5,
              'describe': "Український спортивний коментатор Кирило Круторогов дебютував у літературі 2017 року з "
                          "книгою “#Бомбардир”. Присвячена вона грі мільйонів, але не тій її стороні, яка приваблює "
                          "пересічного вболівальника. Травми, виснажливі тренування, боротьба за місця у стартовому "
                          "складі — не менш важливі складові футбольної кар'єри, про які, однак, не заведено "
                          "говорити вголос. Це історія успіху та розчарувань, яка висвітлює все: від першого кроку "
                          "новачка на газон до зіркового життя чемпіонів. Книга Круторогова дозволяє зазирнути за "
                          "лаштунки футболу. Таким ви його ще не бачили! Якщо ви вболівальник, то для вас це відповідь "
                          "на питання, що почитати цікавого."},
        '5': {'year': '2016', 'publisher': 'Книжный клуб "Клуб семейного досуга"', 'rating': 5,
              'describe': "Нарешті ми застали той час, коли популярні книги українською почали екранізувати. Роман "
                          "“Століття Якова” розповідає історію, яка одночасно здається фантастичною і реальною. "
                          "Старий Мех, віковий дід із сивою бородою, спостерігав за тим, як змінюються держави і "
                          "режими. Російська імперія, УНР, Польща, СРСР і сучасна Україна. Дитина, підліток, юнак, "
                          "чоловік, а тепер похила людина. Яків не просто спостерігав за часом, а плинув разом з "
                          "ним, отримуючи один за одним удари долі. Війни і особисті драми пройшли, залишивши після "
                          "себе душевні рани і тяжкі спогади..."}

    }
    cover = {
        '1': 'https://i.grenka.ua/shop/1/9/774/dotsya_62b_300_300.png',
        '2': 'https://i.grenka.ua/shop/1/10/524/usi-yikhni-demoni_16b_300_300.jpg',
        '3': 'https://i.grenka.ua/shop/1/10/806/yupak_e68_300_300.png',
        '4': 'https://i.grenka.ua/shop/1/6/189/-bombardir_178_300_300.jpg',
        '5': 'https://i.grenka.ua/shop/1/4/670/stolittya-yakova_0d7_300_300.jpg'
    }
    return render(request, 'top_one.html', context={'place': place, 'name': top[place],
                                                    'author': author[place],
                                                    'year': info[place]['year'],
                                                    'publisher': info[place]['publisher'],
                                                    'rating': info[place]['rating'] * '★',
                                                    'describe': info[place]['describe'],
                                                    'cover': cover[place]})
